title: BangkokShell Operation, DLL Side-loading leveraging Windows Service
id: 4cf9d1bd-7589-480f-a693-5feb701b7dbf
version: 1.0
first_imported: 2023-12-29
last_modified: 2023-12-29
status: RELEASED
sharing: TLP:CLEAR
author: TTC-CERT
description: Detects the BeautyPilot.exe executed by Windows Service, used to side-loading DLL Loader. The Loader will inject Shellcode which can be used to execute commands received from C2 via CMD, PowerShell, and inject shellcode directly to memory.
category: Malware
hash: d8516f2dda776a7e48e3995e311f07676a5a95ad58435078d92541d58998accb 
references: https://www.ttc-cert.or.th
logsource:
   category: process_creation
   product: windows
detection: 
   selection1:
       ParentImage|endswith: '\services.exe'
       Company: 'Two Pilots'
   selection2:
       Image|startswith: 'c:\windows\system32\'
   selection3:
       ParentImage|endswith: '\BeautyPilot.exe'
       Image|endswith:
           - '\cmd.exe'
           - '\powershell.exe'
   condition: (selection1 and not selection2) or selection3
falsepositives: Unknown
level: medium
