title: Detect Scheduled Task Running rundll32.exe with Specific Arguments
id: 4709dc9c-59b2-4ceb-b9ff-2bb040020fae
version: 1.0
first_imported: 2023-04-24
last_modified: 2023-04-24
status: RELEASED
sharing: TLP:CLEAR
author: TTC-CERT
description: Detects a scheduled task running the command "rundll32.exe %appdata%\Local\Temp\<dll file> StartW" on a host.
references: https://research.checkpoint.com/2023/pandas-with-a-soul-chinese-espionage-attacks-against-southeast-asian-government-entities/
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentCommandLine|contains:
            - 'svchost.exe -k netsvcs' # exec on win10
            - 'taskeng.exe'       # exec on win7
        CommandLine|contains|all:
            - 'rundll32.exe'
            - 'StartW'
    condition: selection
fields:
    - CommandLine
    - ParentCommandLine
falsepositives:
    - Unknown
level: high
tags:
   - attack.persistence
   - attack.t1053.005
   - attack.defense.evasion
   - attack.t1218.011
