title: Syncro - Process or Service Detection
id: 0f47801b-f599-4edf-8dbf-bb5d6c74fd29
version: 1.0
first_imported: 2023-01-04
last_modified: 2023-01-04
status: RELEASED
sharing: TLP:CLEAR
author: TTC-CERT
description: This rule triggers an alert if the SIEM system detects a Syncro process or service running on a host.
references: https://syncromsp.com/
logsource:
  category: process_creation
  product: windows
detection:
  selection1:
    EventID: 4688
    ProcessName: Syncro*
  selection2:
    Image|contains: '\Syncro.Overmind.Service.exe'
  selection3:
    Image|endswith: '\sc.exe'
    CommandLine|contains: ' start Syncro'
  condition: selection1 or selection2 or selection3
falsepositives:
- This rule may trigger false positives if the Syncro processes or services are running on a host for legitimate purposes.
level: high