title: Agenda Golang Ransomware
id: a658a850-39d5-11ed-a261-0242ac120002
version: 1.0
first_imported: 2022-09-22
last_modified: 2022-09-22
status: RELEASED
sharing: TLP:CLEAR
author: TTC-CERT
description: Detects Agenda Golang ransomware behavior. This ransomware is believed to be from the threat actor named Qilin
category: Malware
hash: e4a319f7afafbbd710ff2dbe8d0883ef332afcb0363efd4e919ed3c3faba0342
logsource:
   category: process_creation
   product: windows
detection: 
   # Agenda ransomware process
   selection1:
      ParentImage|contains: '\Public\'
      ParentCommandLine|contains: 
         - '-password'
         - '-safe'
         - '-no-proc'
         - '-no-services'
         - '-path'
         - '-stat'
         - '-alter'
         - '-min-size'
         - '-encryption'
         - '-ips'
   # cmd.exe execute vssadmin.exe to delete shadow copy file
   selection2:
      Image|endswith: '\cmd.exe'
      CommandLine|contains|all:
         - 'vssadmin.exe'
         - 'delete'
         - 'shadows'
   # powershell.exe used to restart LanmanWorkstation service
   selection3:
      Image|endswith: '\powershell.exe'
      CommandLine|contains|all:
         - 'LanmanWorkstation'
         - 'Restart-Service'
   selection4:
      Image|endswith: '\net.exe'
      CommandLine|endswith: 'use'
   condition: selection1 and (selection2 or selection3 or selection4)
falsepositives: Unknown
level: critical
tags:
   - attack.impact
   - attack.t1486
   - attack.t1489
   - attack.t1490